app/views/users/follows.html.erb

  <tbody>
      <% @user.following_user.where.not(id: current_user.id).each do |user| %>
---
SELECT "users".* FROM "users"