app/views/books/index.html.erb

  <span class="glyphicon glyphicon-heart" aria-hidden="true"></span>
  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]

  <span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span>
  <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 10]]

<td>
<%= book.book_comments.count %>件コメント
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 10]]