app/views/books/show.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<td>
<% if Favorite.find_by(user_id: @current_user.id, book_id: @book.id) %>