app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aa"], ["user_id", 1], ["created_at", "2020-04-05 14:07:28.975511"], ["updated_at", "2020-04-05 14:07:28.975511"]]
SELECT "books".* FROM "books"
---
  def create
    @newbook = Book.new(book_params)
    @newbook.user_id = current_user.id
    if @newbook.save
      flash[:notice] = "successfully created book!"
     redirect_to book_path(@newbook.id)
   else
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "s"], ["updated_at", "2020-04-08 04:32:06.673176"], ["id", 32]]
---
  def update
    @book = Book.find(params[:id])
    @user = current_user
    if @book.update(book_params)