app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", ""], ["user_id", 1], ["book_id", 6], ["created_at", "2020-04-06 10:50:19.388824"], ["updated_at", "2020-04-06 10:50:19.388824"]]
---
	def create
	@book = Book.find(params[:book_id])
	@book_comment = current_user.book_comments.new(book_comment_params)
	@book_comment.book_id = @book.id
	@book_comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 10], ["id", 10], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 15]]
---
	def destroy
	@book = Book.find(params[:book_id])
	@book_comments = @book.book_comments.find(params[:id])
	@book_comment.destroy