app/models/user.rb

  def following?(user)
    following_user.include?(user)
---
SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follow_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

  def already_liked?(book)
    self.favorites.exists?(book_id: book.id)
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 1], ["LIMIT", 1]]